[
  {
    "title": "Intern, Brand and Digital Communications",
    "company": "Comcast",
    "description": "Comcast brings together the best in media and technology. We drive innovation to create the worlds best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast.",
    "location": "Philadelphia, PA",
    "apply": "https://jobs.comcast.com/jobs/description/regular?external_or_internal=external&job_id=R330221&IT=LinkedIn",
    "concentration": "General",
    "date_posted": "02/15/22",
    "job_type": "Internship"
  },
  {
    "title": "UX Designer - 2022 Summer Internship",
    "company": "Nutanix",
    "description": "As part of Global Design organization, the design team is seeking a strong designer for the San Jose,CA office. We are looking for someone who is passionate about solving complex problems, and whose work demonstrates strong design aptitude for enterprise-level product design. We need someone who is excited by the opportunity to work with a globally distributed design team and can help grow and connect design projects across Nutanix's worldwide offices",
    "location": "Boston, MA",
    "apply": "https://nutanix.eightfold.ai/careers?pid=9749037&domain=nutanix.com&jvst=Job%2BBoard&_jvsd=LinkedIn",
    "concentration": "Web ",
    "date_posted": "",
    "job_type": "Internship"
  },
  {
    "title": "User Experience (UX) Intern",
    "company": "Masonite",
    "description": "At Masonite we value how the power of design positively impacts business, technology, and the lives of our customers and employees. In this growing capability for Masonite you can expect to be challenged and learn with exposure to major initiatives that drive business results. The right individual will be someone who is passionate about how User Experience contributes to consumer-centric innovation through hands-on experience working within cross-functional teams.",
    "location": "Tampa, FL",
    "apply": "https://masonite.wd1.myworkdayjobs.com/masonite_careers/job/Tampa-FL/User-Experience--UX--Intern_R-123289",
    "concentration": "Web ",
    "date_posted": "",
    "job_type": "Internship"
  },
  {
    "title": "Web Development Intern",
    "company": "Banner Engineering",
    "description": "This position is responsible for the development and support of the corporate web sites and web-based applications that are part of the Banner suite of applications. Specifically, based on needs assessment and corporate direction, the Web Developer will develop information, content and data requirements and translate them into system designs. From the designs, the developer will create functional, maintainable web-based applications and support existing applications to correct errors and improve application performance. This is an in-person internship, located at our corporate headquarters in Plymouth, MN. Compensation is determined by year in school, starting at $20/hour.",
    "location": "Plymouth, MN",
    "apply": "https://recruiting.ultipro.com/ban1010/JobBoard/e9066a66-c3b9-e25c-d036-116705c05e46/OpportunityDetail?opportunityId=92096fea-f4a4-44b3-9fed-8eb810db0a39&utm_source=LINKEDIN&utm_medium=referrer",
    "concentration": "Web ",
    "date_posted": "",
    "job_type": "Internship"
  }
]
